public static class MattressData
{
    public static List<Mattress> MattressList = 
    [
        new Mattress { Name = "Односторонний матрас Классик 6 Моно", BasePrice =  14630M,
        Width = 1600, Height = 180, Depth = 2000, Rigidity = "высокая", LoadWeight = 150,
        Case = "Искусственный жаккард, стеганый синтепоном",
        Composition = new List<string>{
            "пенополиуретан 15 мм", "кокосовая койра 30 мм", "спанбонд",
            "усиленный пружинный блок Боннель", "войлок", "спанбонд", "ППУ по периметру"
            },
        ImageUrl="img/products/Матрасы/Односторонний матрас Классик 6 Моно.jpg"},

        new Mattress { Name = "Односторонний матрас Премиум 8 Моно", BasePrice =  22253M,
        Width = 1600, Height = 185, Depth = 2000, Rigidity = "средняя", LoadWeight = 130,
        Case = "Хлопковый жаккард, стеганый синтепоном",
        Composition = new List<string>{
            "натуральный латекс", "кокосовая койра 10 мм", "войлок",
            "пружинный блок Multipocket (500 пружин/м2)", "войлок", "спанбонд", "каркас из ППУ по периметру"
            },
        ImageUrl="img/products/Матрасы/Односторонний матрас Премиум 8 Моно.jpg"},

        new Mattress { Name = "Односторонний матрас Комфорт 3 Моно", BasePrice =  12274M,
        Width = 1600, Height = 160, Depth = 2000, Rigidity = "средняя", LoadWeight = 110,
        Case = "Хлопковый жаккард, стеганый синтепоном",
        Composition = new List<string>{
            "спанбонд", "кокосовая койра 10 мм", "войлок",
            "пружинный блок Multipocket (500 пружин/м2)", "войлок", "спанбонд", "каркас из ППУ по периметру"
            },
        ImageUrl="img/products/Матрасы/Односторонний матрас Комфорт 3 Моно.jpg"},

        new Mattress { Name = "Двухсторонний матрас Классик 4", BasePrice =  13224M,
        Width = 1600, Height = 190, Depth = 2000, Rigidity = "средняя", LoadWeight = 110,
        Case = "Искусственный жаккард, стеганый синтепоном",
        Composition = new List<string>{
            "пенополиуретан 15 мм", "кокосовая койра 10 мм", "спанбонд",
            "усиленный пружинный блок Боннель", "спанбонд", "кокосовая койра 10 мм",
            "пенополиуретан 15 мм", "ППУ по периметру"
            },
        ImageUrl="img/products/Матрасы/Двухсторонний матрас Классик 4.jpg"},

        new  Mattress { Name = "Беспружинный односторонний матрас Комфорт 4 Монолит", BasePrice =  12492M,
        Width = 1600, Height = 155, Depth = 2000, Rigidity = "средняя", LoadWeight = 120,
        Case = "Хлопковый жаккард, стеганый синтепоном",
        Composition = new List<string>{
            "Ортопена повышенной упругости"
            },
        ImageUrl="img/products/Матрасы/Беспружинный односторонний матрас Комфорт 4 Монолит.jpg"},

        new  Mattress { Name = "Двухсторонний матрас Юниор 3", BasePrice =  6829M,
        Width = 1600, Height = 155, Depth = 2000, Rigidity = "средняя", LoadWeight = 110,
        Case = "Хлопковый жаккард, стеганый синтепоном",
        Composition = new List<string>{
            "спанбонд", "кокосовая койра 10 мм", "войлок",
            "блок независимых пружин (500 пружин на спальное место)", "войлок", "пенополиуретан",
            "каркас из ППУ по периметру"
            },
        ImageUrl="img/products/Матрасы/Двухсторонний матрас Юниор 3.jpg"},

        new  Mattress { Name = "Беспружинный матрас Юниор 3 Монолит", BasePrice =  5562M,
        Width = 1600, Height = 115, Depth = 2000, Rigidity = "средняя", LoadWeight = 110,
        Case = "Хлопковый жаккард, стеганый синтепоном",
        Composition = new List<string>{
            "спанбонд", "кокосовая койра 10 мм", "ортопена повышенной упругости",
            "кокосовая койра 10 мм", "спанбонд"
            },
        ImageUrl="img/products/Матрасы/Беспружинный матрас Юниор 3 Монолит.jpg"},

        new  Mattress { Name = "Двухсторонний матрас Премиум 5", BasePrice =  23065M,
        Width = 1600, Height = 195, Depth = 2000, Rigidity = "выше среднего", LoadWeight = 130,
        Case = "Хлопковый жаккард, стеганый синтепоном",
        Composition = new List<string>{
            "спанбонд", "кокосовая койра 20 мм", "войлок",
            "пружинный блок Multipocket (500 пружин/спальное место)", "войлок",
            "кокосовая койра 20 мм", "спанбонд", "каркас из ППУ по периметру"
            },
        ImageUrl="img/products/Матрасы/Двухсторонний матрас Премиум 5.jpg"},
    ];
}

